# GetEntity Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctFittingAndAccessoryPressureDropUIDataItem..::..GetEntity Method
DuctFittingAndAccessoryPressureDropUIDataItem Class See Also
---
Returns the entity set by UI server. or an invalid entity otherwise.
**Namespace:** Autodesk.Revit.UI.Mechanical**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public Entity GetEntity()
```

Visual Basic
---
```text
Public Function GetEntity As Entity
```

Visual C++
---
```text
public:
Entity^ GetEntity()
```

# ### Return Value
The returned Entity.
# Remarks
The Entity that is returned is a copy of the stored data (with copy-on-write optimization). Modifying it is allowed (even with restricted write), but to save your changes you must call SetEntity.
# See Also
DuctFittingAndAccessoryPressureDropUIDataItem Class
Autodesk.Revit.UI.Mechanical Namespace